Revit 2027 API
PlumbingUtils.BreakCurve Method
 Breaks the pipe curve into two parts at the given position.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId BreakCurve(
	Document document,
	ElementId pipeId,
	XYZ ptBreak
)
Public Shared Function BreakCurve (
	document As Document,
	pipeId As ElementId,
	ptBreak As XYZ
) As ElementId
public:
static ElementId^ BreakCurve(
	Document^ document,
	ElementId^ pipeId,
	XYZ^ ptBreak
)
static member BreakCurve :
        document : Document *
        pipeId : ElementId *
        ptBreak : XYZ -> ElementId
Parameters
document Document
 The document.
pipeId ElementId
 The element id of the pipe curve to break.
ptBreak XYZ
 The break point on the pipe curve.
Return Value
ElementId
 The new pipe curve element id if successful otherwise if a failure occurred an invalidElementId is returned.
Exceptions
Exception | Condition
ArgumentException |  "The element is neither a pipe nor a pipe placeholder." -or- "The given point is not on the pipe curve."
ArgumentNullException |  A non-optional argument was null
Remarks
 This method is not applicable for breaking the flex pipe.
See Also
Reference
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace